# **CSR & SSR**

### **MPA (M**ulti Page Application)

여러 페이지로 구성된 웹 어플리케이션. 유저와의 인터렉션 발생할 때마다 서버로부터 새로운 HTML을 받아와 해당 링크로 이동해 페이지 전체 새로 렌더링함. 전통적인 웹 페이지 구성 방식.

> SSR 방식 사용
> 

### **SPA (Single Page Applictaion)**

하나의 페이지로 구성된 웹 어플리케이션. 브라우저에 최초에 한 번 페이지 전체를 로드하고 이후부터는 특정 부분만 Ajax를 통해 데이터 바인딩. 현재 많이 사용하는 방식.

> CSR 방식 사용
> 

---

### **SSR (**Server Side Rendering)

- **장점**
    - 검색엔진 최적화(SEO, serach engine optimization) 가능
    - 초기로딩 성능개선
        
        > 첫 렌더링된 HTML을 클라이언트에게 전달해주어 초기 로딩 속도를 많이 줄여줌
        > 
- **단점**
    - TTV(Time To View)와 TTI(Time To Interact) 간에 시간 간격이 존재
        
        > 사용자가 버튼을 클릭하거나 이동하려고 해도 아무런 반응이 없을 수 있음.
        > 
    - 성능 악화 가능성
        
        > 요청할 때마다 새로고침이 일어남. 서버에서 리소스 전달받고 화면에 렌더링하는 과정을 매번 해야 함. 사용자 경험 다소 떨어짐. 서버 자원 많이 사용 → 불필요한 트래픽 낭비
        > 
- 사용 권장 상황
    - 최초 로딩이 빨라야 할 때
    - 유저의 동작에 대한 상호작용이 적을 때
    - 메인 스크립트가 무거울 때 (한 번 요청하면 렌더 가능한 페이지가 옴)
    - SEO가 필요할 때

### **CSR (**Client Side Rendering)

- **장점**
    - 트래픽 감소
        
        > (웹앱을 브라우저에 먼저 로드 후) 필요한 데이터만 받아옴. 
        (서버는 JSON 파일만 보내줌, 뷰 렌더링(HTML 그리기)은 JS로 클라이언트가.). 
        서버 부하 감소.
        > 
    - 사용자 경험
        
        > 새로고침이 발생하지 않음. 사용자가 네이티브 앱과 같은 경험을 할 수 있음
        > 
- **단점**
    - 검색 엔진
        
        > 크롬에서 리액트로 만든 웹앱 소스를 확인하면 내용이 비어있음. 검색엔진 크롤러가 데이터 수집에 어려움이 있을 가능성 존재
        > 
        > 
        > 구글 검색엔진은 자바스크립트 엔진이 내장되어있지만, 네이버나 다음 등 검색엔진은 크롤링에 어려움이 있어 SSR을 따로 구현해야하는 번거로움 존재
        > 
    - 초기 로딩 속도 느림
        
        > 모든 JS 파일을 다 받아와야 함
        > 
- 사용 권장 상황
    - 네트워크가 빠를 때
    - 유저와 상호작용이 많을 때 (아예 렌더링이 안 돼서 사용자의 행동을 막는 게 오히려 사용자 경험에 좋음)
    - 메인 스크립트가 가벼울 때 (메인스크립트 로딩이 끝나면 API로 데이터 요청 보냄)
    - SEO가 중요하지 않을 때

### **[참고 자료]**

- [링크](https://github.com/gyoogle/tech-interview-for-developer/blob/master/Web/CSR%20%26%20SSR.md)
- [링크](https://proglish.tistory.com/216)
- [링크](https://miracleground.tistory.com/165)
