## 함수형 프로그래밍

--- 

1. 다음 중 함수형 프로그래밍과 관련된 말이 아닌것은?  
  1️⃣. Pure Function  
  2️⃣. Override  
  3️⃣. Stateless  
  4️⃣. Immutability  
  
A. 2번, Override는 객체지향프로그래밍(OOP)와 더 관련 있는 단어이다.  

<br>

2. 1급 객체의 특징이 아닌 것을 고르시오.  
  1️⃣. 변수나 데이터 구조 안에 담을 수 있다.  
  2️⃣. 반환값으로 사용할 수 있다.  
  3️⃣. 동적으로 프로퍼티 할당이 불가능하다.  
  4️⃣. 파라미터로 전달할 수 있다.  

A. 3번, 동적으로 프로퍼티 할당이 가능하다.  

<br>

3. 다음함수가 순수함수인지 아닌지 판별하고, 순수함수가 아니라면 그 이유를 쓰시오.  
```swift
let num = 1;
function add(a) {
	return a + num;
}
```

A. 순수함수가 아니다. 함수 밖ㅇ 있는 num을 참조하기 때문에 함수 외부의 변수인 num의 값이 달라지면 함수의 결과값도 달라지기 때문이다.  

<br>

4. 다음 함수가 비상태, 불변성을 만족하는지 판별하고, 아니라면 그 이유를 쓰고 함수를 수정하시오.
```swift
let person = { name: "jongmin", age: "26" };

function increaseAge(person) {
    person.age = person.age + 1;
    return person;
}
```

A. 비상태, 불변성을 만족하지 않는다. person객체의 값을 변경하기 때문이다. ...연산자를 사용해 값을 복사하여 복사한 값을 변경해주는 방식으로 코드를 수정한다.


